---
kind: type
id: T:Autodesk.Revit.DB.Area
zh: 面积区域
source: html/44ffe200-fb00-b64d-a2fb-6db2299eaef8.htm
---
# Autodesk.Revit.DB.Area

**中文**: 面积区域

Provides access to the area topology in Autodesk Revit.

## Syntax (C#)
```csharp
public class Area : SpatialElement
```

## Remarks
The area object can be queried for its boundary for use in space planning tools.